app/controllers/tv_shows_controller.rb

  def index
    @tv_shows = TvShow.search(params)
---
SELECT "tv_shows".* FROM "tv_shows" WHERE (tv_shows.show_name LIKE '%channel_A_1%') AND (channels.name LIKE '%channel_A_1%')

  def mark_favorite
    @tv_show = TvShow.find(params[:id])
---
SELECT  "tv_shows".* FROM "tv_shows" WHERE "tv_shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]